OdIfcFile.getGeomExtents(OdGeExtents3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current geometrical extents of the model.
\param ext [out] A placeholder for the current geometry extents object to be returned to a calling subroutine.
\returns eOk if the current extents were successfully returned; otherwise, the method returns an appropriate error code.
\remarks
The method returns the model extents only if the model was created by calling the setGeomResource() method.
The method accepts an instance of the OdGeExtents3d class, fills it with the data about the model's extents and
returns it to a calling subroutine.

OdIfcFile.writeFile(OdSmartPtr&lt;OdStreamBuf&gt;,System.Boolean)
\details
Writes data from the specified stream buffer to a physical file.
\param pStream      [in] A smart pointer to the output stream buffer object to wtite data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdIfcFile.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the file object to a physical file.
\param fileName     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdIfcFile.readFile(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified IFC file.
\param pStream [in] A smart pointer to the data buffer associated with the input IFC file.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error code.

OdIfcFile.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reads data from a specified IFC file.
\param fileName [in] A string that contains the full path to the input file to read data from.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error code.

OdIfcFile.detach
\details
Closes the model attached to the file object and detaches the repository object associated with the model.
After detaching, it is possible to work with the repository and the model at a low level.
\returns A smart pointer to the unattached repository instance.

OdIfcFile.initialize(OdDAI.Repository*)
\details
Initializes OdIfcFile instance with a specified repository if it contains appropriate information in IFC format (single model of supported IFC schema).
After the initialization, the model becomes opened in read-only access mode by default and stays in this mode while the repository is attached to the file object.
\param pRepo [in] A raw pointer to the repository object to be attached to the file object.
\returns eOk if the repository object was successfully attached; otherwise, the method returns an appropriate error code.

OdIfcFile.setFileName(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assigns a name (file name) to the OdIfcFile container.

OdIfcFile.getFileName
Retrieves the current name (file name) of a physical file associated with the repository object.
\returns A string that contains the file name.

OdIfcFile
\details
A class that implements working with an IFC file header and data sections (header and model).